clc;
%井1的理论产量
g=9.8;
E=2.1e11;                           %弹性模量，pa
ror=8456;                           %钢密度，kg/m^3
ro=997;                             %液体密度，kg/m^3
Dp=0.07;                            %一级杆时的泵径 m
Dr1=0.022;                          %一级杆直径，m
L1=792.5;                           %一级杆长，m
S=3.2;                              %冲程  m     
n=7.6;                              %冲次，1/min
Ap=pi/4*Dp^2;                       %泵的界面积，m^2
Ar1=pi/4*Dr1^2;                     %一级杆截面积,m^2
Q=1440*S*n*Ap*ro/1000;              %日产量  m^3/day
display(Q);

%井1的实际产量
Wl=Ap*ro*L1*g;                      %液柱载荷
yr=Wl*L1/(E*Ar1);                   %静载荷引起的冲程损失
Wr=Ar1*L1*ror*g;                    %一级杆的重量
yg=Wr*S*n^2*L1/(1790*Ar1*E);        %惯性引起的冲程增加量
hp=(S-yr+yg)/S;                     %冲程损失的影响系数
bo=1.025;                           %原油体积系数
bw=1;                               %水的体积系数
Fw=0.98;                            %含水率
ht=1/(bo*(1-Fw)+bw*Fw);             %液体收缩影响排量系数
Q1=hp*ht*Q*ro/1000;                 %实际产量
display(Q1)
Q1/Q

%井2的实际产量
S=4.2;                              %冲程  m     
n=4;                                %冲次，1/min
L1=523.61;                          %一级杆长，m
L2=664.32;                          %二级杆长，m
L3=618.35;                          %三级杆长，m
Dp=0.044;                           %三级杆时的泵径 m
Dr1=0.025;                          %一级杆直径，m
Dr2=0.022;                          %二级杆直径，m
Dr3=0.019;                          %三级杆直径，m
Ap=pi/4*Dp^2;                       %泵的界面积，m^2
Ar1=pi/4*Dr1^2;                     %一级杆截面积,m^2
Ar2=pi/4*Dr2^2;                     %二级杆截面积,m^2
Ar3=pi/4*Dr3^2;                     %三级杆截面积,m^2
Wl2=Ap*ro*(L1+L2+L3)*g;             %液柱载荷
yr=Wl2/E*(L1/Ar1+L2/Ar2+L3/Ar3);    %静载荷引起的冲程损失
Wr1=Ar2*L2*ror*g;                   %一级杆的重量
Wr2=Ar2*L2*ror*g;                   %一级杆的重量
Wr3=Ar2*L2*ror*g;                   %一级杆的重量
yg=S*n^2/(1790*E)*(Wr1*L1/Ar1+Wr2*L2/Ar2+Wr3*L3/Ar3);        %惯性引起的冲程增加量
hp=(S-yr+yg)/S;                     %冲程损失的影响系数
bo=1.025;                           %原油体积系数
bw=1;                               %水的体积系数
Fw=0.912;                            %含水率
ht=1/(bo*(1-Fw)+bw*Fw);             %液体收缩影响排量系数
Q=1440*S*n*Ap*ro/1000;                      %理论日产量  m^3/day
Q2=hp*ht*Q*ro/1000;                         %实际日产量  m^3/day
Q2/Q
display(Q)
display(Q2)

