function f=mubiaohanshu(x)
%%%定义目标函数
f=0;
a=x(1);
b=x(2);
lamda1=x(3);
lamda2=x(4);
lamda3=x(5);
h=1;
tmin=0;
tmax=170;
N=1+(tmax-tmin)/h;
y6=zeros(6,N);
y9=zeros(6,N);
x=zeros(1,N);
y9(:,1)=[ 2043922.166765 ; -5379.544693; 8186504.631471;   -407.095342 ;  4343461.714791 ;     3516.052656];%%初值  -1732113.220573    9092044.771852    1732113.220573      -4453.807606      -1566.513180       4453.807606
y6(:,1)= [-1732113.220573 ;-4453.807606;  9092044.771852;    -1566.513180 ;  1732113.220573 ;     4453.807606]; %%%% -1732113.220573    9092044.771852    1732113.220573      -4453.807606      -1566.513180       4453.80760
x(1)=0;
for i=2:N
    x(i)=x(i-1)+h;
    k16=vdp(y6(:,i-1));
    k26=vdp(y6(:,i-1)+h*k16/2);
    k36=vdp(y6(:,i-1)+h*k26/2);
    k46=vdp(y6(:,i-1)+h*k36);
    y6(:,i)=y6(:,i-1)+h*(k16+2*k26+2*k36+k46)/6; %按照龙格库塔方法进行数值求解
    
    k19=vdp(y9(:,i-1));
    k29=vdp(y9(:,i-1)+h*k19/2);
    k39=vdp(y9(:,i-1)+h*k29/2);
    k49=vdp(y9(:,i-1)+h*k39);
    y9(:,i)=y9(:,i-1)+h*(k19+2*k29+2*k39+k49)/6; %按照龙格库塔方法进行数值求解
   
end
%%%%%%关于y6和y9 第t+1列存储了t时刻的状态向量
y6=y6(1:2:5,:);
y9=y9(1:2:5,:);%%%只保留卫星的位置信息

%---------交叉定位----------------%
pos1=zeros(3,N);%%%%LS估计
pos2=zeros(3,N);%%TLS估计
ran=[];
t=50;
for t=49:171
[tempp1,tempp2,temp]=crosslocal(y6,y9,t);
pos1(:,t+1)=tempp1;
pos2(:,t+1)=tempp2;
ran=[ran temp];
end


%%%%           利用定位后的数据pos1来计算个时刻的状态估计
[xx,yy,zz]=chafen(pos1);  %xx:x方向的状态向量（位置 速度 加速度）yy zz同此



for t=50:170
    x=xx(1,t+1);
vx=xx(2,t+1);
ax=xx(3,t+1);%%%t时刻的x方向目标状态向量

y=yy(1,t+1);
vy=yy(2,t+1);
ay=yy(3,t+1);

z=zz(1,t+1);
vz=zz(2,t+1);
az=zz(3,t+1);

Gm=3.986005e14;

r_abs=norm([x y z]);%%模
v_abs=norm([x y z]);
kx=v_abs*(ax+Gm*x/r_abs^3)/vx;
ky=v_abs*(ay+Gm*y/r_abs^3)/vy;
kz=v_abs*(az+Gm*z/r_abs^3)/vz;

    f=f+(lamda1/(a-b*t)-kx)^2+(lamda2/(a-b*t)-ky)^2+(lamda3/(a-b*t)-kz)^2;
end
