%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%函数作用：提取一个子弹的特征向量
          % 输入：同一幅图的次棱信息
           %输出：一个子弹次棱信息的特征向量
function B=character(c1,c2,c3,c4,a)   %c1,c2,c3,c4 为同意幅图的四个次棱，a为x轴上数据点的个数
                                      %默认时a=564
for j=250:500;

i=1:a;      %x轴点的个数。
x(i)=0:0.00275:1.54825;
for i=1:a
    
    z1(i)=c1((a*(j-1))+i,3);
    z2(i)=c2((a*(j-1))+i,3);
    z3(i)=c3((a*(j-1))+i,3);
    z4(i)=c4((a*(j-1))+i,3);
end



zzz=zeros(1,a);
zzz1=lvbo(z1);

zzz2=lvbo(z2);
zzz3=lvbo(z3);
zzz4=lvbo(z4);
zzz10=0;
zzz20=0;
zzz30=0;
zzz40=0;
zzz10=zzz10+zzz1;
zzz20=zzz20+zzz2;
zzz30=zzz30+zzz3;
zzz40=zzz40+zzz4;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%去掉前面的几个由误差的点后的截面
Z1=zzz1(40:a-200);
Z2=zzz2(40:a-200);
Z3=zzz3(40:a-200);
Z4=zzz4(40:a-200);
Z10=0;
Z20=0;
Z30=0;
Z40=0;
Z10=Z10+Z1;
Z20=Z20+Z2;
Z30=Z30+Z3;
Z40=Z40+Z4;
x1=x(40:a-200);
end


B=[Z10;Z20;Z30;Z40]';
size(B);



