%%%%%%%%%%%%%%%%%
%该函数的作用是对两颗子弹进行匹配
%输入：a第一颗子弹的特征向量 b第二颗子弹的特征向量
%输出：h次棱两两的相似度 r1 a，b之间的相似度，k已那种方式进行匹配，共有4种方式，见%论文，K=1，2，3，4
function [h,r1,k]=charactermatch(a,b)  %a第一颗子弹 % b为第二颗子弹 
%h=zeros(4,4);
format long
m=1:4;
k=0;
for m1=m(1):1:m(end);
    k=k+1;
    n=1:4;
    k1=0;
    for n1=n(1):1:n(end);
    k1=k1+1;



g=corrcoef(a(:,k),b(:,k1));
f=g(2,1);

%求出数组d和d1的相关系数,用f表示


h(k,k1)=f;
%将数据cm和c1n按照上述方法所得到的相关系数的均值赋值到矩阵h中
    end
end

h;
%输出按照上述方法得到的相关系数矩阵,例如h(i,j)表示ci和c1j之间的相关系数.


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%下面找出最佳的次棱匹配

r(1)=(h(1,1)+h(2,2)+h(3,3)+h(4,4))/4;%当c1.dat与c11.dat匹配时各个匹配的次棱的相关系数的均值.
r(2)=(h(1,2)+h(2,3)+h(3,4)+h(4,1))/4;%当c1.dat与c12.dat匹配时各个匹配的次棱的相关系数的均值.
r(3)=(h(1,3)+h(2,4)+h(3,1)+h(4,2))/4;%当c1.dat与c13.dat匹配时各个匹配的次棱的相关系数的均值.
r(4)=(h(1,4)+h(2,1)+h(3,2)+h(4,3))/4;%当c1.dat与c14.dat匹配时各个匹配的次棱的相关系数的均值.
r1=max(r);

k=1;
while r(k)~=r1;
    k=k+1;
end
k ;%求出与c1.dat匹配的c1k.dat
