%此程序的作用得到两幅图次棱的两两相似度，两个子弹的相似度，以及匹配的方式


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%产生一个xz轴平面
load    F:\建模\题\6x2次棱数据\77T1-1504519\c1.dat 
load    F:\建模\题\6x2次棱数据\77T1-1504519\c2.dat
load    F:\建模\题\6x2次棱数据\77T1-1504519\c3.dat
load    F:\建模\题\6x2次棱数据\77T1-1504519\c4.dat
load    F:\建模\题\6x2次棱数据\77T2-1504519\c11.dat
load    F:\建模\题\6x2次棱数据\77T2-1504519\c12.dat
load    F:\建模\题\6x2次棱数据\77T2-1504519\c13.dat
load    F:\建模\题\6x2次棱数据\77T2-1504519\c14.dat


a1=564;

b1=character(c1,c2,c3,c4,a1);
b2=character(c11,c12,c13,c14,a1);
[h,r1,k]=charactermatch(b1,b2);
h
r1
k
