

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 输入为y固定时，xoz平面的z值，输出为经过中值滤波，低通滤波，高斯滤波后的z值。
function zzz=lvbo(z)    
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%进行中值滤波
zz=medianfun(z,5);
%figure(3)
%plot(x,zz）

%低通滤波器的设计
%采用BUtterworth型
%采样率363HZ截止频率100HZ
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%设计低通滤波器
Fs=363;
[b,a]=butter(9,100/363,'low');
[H,w]=freqz(b,a,512);
%figure(4)
%plot(w*Fs/(2*pi),abs(H));


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%信号进行滤波
sf=filter(b,a,zz);
%figure(5)
%plot(x,sf);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%进行高斯滤波
yy=filter(gaussfiltcoef(363,20),1,sf);
%figure(6)
%plot(x,yy);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%看前后频谱图
S=fft(z,512);
SF=fft(sf,512);
w1=(0:255)/256*(Fs/2);
%figure(7)
%plot(w1,abs(S(1:256)));
%figure(8)
%plot(w1,abs(SF(1:256)));
zzz=yy;
