%此程序的作用disiwen   直接将88个数据导入，然后进行特征提取，在进行特征比对，
             但是pc机无法运行，outofmemory 


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%产生一个xz轴平面

A(:,:,1)=load('F:\建模\题\第四问1\第四问题的数据之一\t01-T1-1504519\c1.dat');
A(:,:,2)=load('F:\建模\题\第四问1\第四问题的数据之一\t01-T1-1504519\c2.dat') ;
A(:,:,3)=load('F:\建模\题\第四问1\第四问题的数据之一\t01-T1-1504519\c3.dat') ;
A(:,:,4)=load('F:\建模\题\第四问1\第四问题的数据之一\t01-T1-1504519\c4.dat') ;
A(:,:,5)=load('F:\建模\题\第四问1\第四问题的数据之一\t02-t1-1812492\c1.dat') ;
A(:,:,6)=load('F:\建模\题\第四问1\第四问题的数据之一\t02-t1-1812492\c2.dat') ;
A(:,:,7)=load('F:\建模\题\第四问1\第四问题的数据之一\t02-t1-1812492\c3.dat') ;
A(:,:,8)=load('F:\建模\题\第四问1\第四问题的数据之一\t02-t1-1812492\c4.dat') ;
A(:,:,9)=load('F:\建模\题\第四问1\第四问题的数据之一\t03-T1-1814688\c1.dat') ;
A(:,:,10)=load('F:\建模\题\第四问1\第四问题的数据之一\t03-T1-1814688\c2.dat') ;
A(:,:,11)=load('F:\建模\题\第四问1\第四问题的数据之一\t03-T1-1814688\c3.dat') ;
A(:,:,12)=load('F:\建模\题\第四问1\第四问题的数据之一\t03-T1-1814688\c4.dat') ;
A(:,:,13)=load('F:\建模\题\第四问1\第四问题的数据之一\t04-T1-1928033\c1.dat') ;
A(:,:,14)=load('F:\建模\题\第四问1\第四问题的数据之一\t04-T1-1928033\c2.dat') ;
A(:,:,15)=load('F:\建模\题\第四问1\第四问题的数据之一\t04-T1-1928033\c3.dat') ;
A(:,:,16)=load('F:\建模\题\第四问1\第四问题的数据之一\t04-T1-1928033\c4.dat') ;
A(:,:,17)=load('F:\建模\题\第四问1\第四问题的数据之一\t05-T1-1931817\c1.dat') ;
A(:,:,18)=load('F:\建模\题\第四问1\第四问题的数据之一\t05-T1-1931817\c2.dat') ;
A(:,:,19)=load('F:\建模\题\第四问1\第四问题的数据之一\t05-T1-1931817\c3.dat') ;
A(:,:,20)=load('F:\建模\题\第四问1\第四问题的数据之一\t05-T1-1931817\c4.dat') ;
A(:,:,21)=load('F:\建模\题\第四问1\第四问题的数据之一\t06-T2-1203959\c1.dat') ;
A(:,:,22)=load('F:\建模\题\第四问1\第四问题的数据之一\t06-T2-1203959\c2.dat') ;
A(:,:,23)=load('F:\建模\题\第四问1\第四问题的数据之一\t06-T2-1203959\c3.dat');
A(:,:,24)=load('F:\建模\题\第四问1\第四问题的数据之一\t06-T2-1203959\c4.dat') ;
A(:,:,25)=load('F:\建模\题\第四问1\第四问题的数据之一\t07-t2-1811345\c1.dat') ;
A(:,:,26)=load('F:\建模\题\第四问1\第四问题的数据之一\t07-t2-1811345\c2.dat') ;
A(:,:,27)=load('F:\建模\题\第四问1\第四问题的数据之一\t07-t2-1811345\c3.dat') ;
A(:,:,28)=load('F:\建模\题\第四问1\第四问题的数据之一\t07-t2-1811345\c4.dat') ;
A(:,:,29)=load('F:\建模\题\第四问1\第四问题的数据之一\t08-T2-1814117\c1.dat') ;
A(:,:,30)=load('F:\建模\题\第四问1\第四问题的数据之一\t08-T2-1814117\c2.dat') ;
A(:,:,31)=load('F:\建模\题\第四问1\第四问题的数据之一\t08-T2-1814117\c3.dat') ;
A(:,:,32)=load('F:\建模\题\第四问1\第四问题的数据之一\t08-T2-1814117\c4.dat') ;
A(:,:,33)=load('F:\建模\题\第四问1\第四问题的数据之一\t09-T2-1923252\c1.dat') ;
A(:,:,34)=load('F:\建模\题\第四问1\第四问题的数据之一\t09-T2-1923252\c2.dat') ;
A(:,:,35)=load('F:\建模\题\第四问1\第四问题的数据之一\t09-T2-1923252\c3.dat') ;
A(:,:,36)=load('F:\建模\题\第四问1\第四问题的数据之一\t09-T2-1923252\c4.dat') ;
A(:,:,37)=load('F:\建模\题\第四问1\第四问题的数据之一\t10-T2-1930832\c1.dat') ;
A(:,:,38)=load('F:\建模\题\第四问1\第四问题的数据之一\t10-T2-1930832\c2.dat') ;
A(:,:,39)=load('F:\建模\题\第四问1\第四问题的数据之一\t10-T2-1930832\c3.dat') ;
A(:,:,40)=load('F:\建模\题\第四问1\第四问题的数据之一\t10-T2-1930832\c4.dat') ;
A(:,:,41)=load('F:\建模\题\第四问1\第四问题的数据之一\t11-T1-1202999\c1.dat') ;
A(:,:,42)=load('F:\建模\题\第四问1\第四问题的数据之一\t11-T1-1202999\c2.dat') ;
A(:,:,43)=load('F:\建模\题\第四问1\第四问题的数据之一\t11-T1-1202999\c3.dat') ;
A(:,:,44)=load('F:\建模\题\第四问1\第四问题的数据之一\t11-T1-1202999\c4.dat') ;
A(:,:,45)=load('F:\建模\题\第四问 2\第四问题的数据之二\t12-T1-1203959\c1.dat');
A(:,:,46)=load('F:\建模\题\第四问 2\第四问题的数据之二\t12-T1-1203959\c2.dat') ;
A(:,:,47)=load('F:\建模\题\第四问 2\第四问题的数据之二\t12-T1-1203959\c3.dat') ;
A(:,:,48)=load('F:\建模\题\第四问 2\第四问题的数据之二\t12-T1-1203959\c4.dat') ;
A(:,:,49)=load('F:\建模\题\第四问 2\第四问题的数据之二\t13-t1-1811345\c1.dat') ;
A(:,:,50)=load('F:\建模\题\第四问 2\第四问题的数据之二\t13-t1-1811345\c2.dat') ;
A(:,:,51)=load('F:\建模\题\第四问 2\第四问题的数据之二\t13-t1-1811345\c3.dat') ;
A(:,:,52)=load('F:\建模\题\第四问 2\第四问题的数据之二\t13-t1-1811345\c4.dat') ;
A(:,:,53)=load('F:\建模\题\第四问 2\第四问题的数据之二\t14-t1-1814117\c1.dat') ;
A(:,:,54)=load('F:\建模\题\第四问 2\第四问题的数据之二\t14-t1-1814117\c2.dat') ;
A(:,:,55)=load('F:\建模\题\第四问 2\第四问题的数据之二\t14-t1-1814117\c3.dat') ;
A(:,:,56)=load('F:\建模\题\第四问 2\第四问题的数据之二\t14-t1-1814117\c4.dat') ;
A(:,:,57)=load('F:\建模\题\第四问 2\第四问题的数据之二\t15-T1-1923252\c1.dat') ;
A(:,:,58)=load('F:\建模\题\第四问 2\第四问题的数据之二\t15-T1-1923252\c2.dat') ;
A(:,:,59)=load('F:\建模\题\第四问 2\第四问题的数据之二\t15-T1-1923252\c3.dat') ;
A(:,:,60)=load('F:\建模\题\第四问 2\第四问题的数据之二\t15-T1-1923252\c4.dat') ;
A(:,:,61)=load('F:\建模\题\第四问 2\第四问题的数据之二\t16-T1-1930832\c1.dat') ;
A(:,:,62)=load('F:\建模\题\第四问 2\第四问题的数据之二\t16-T1-1930832\c2.dat') ;
A(:,:,63)=load('F:\建模\题\第四问 2\第四问题的数据之二\t16-T1-1930832\c3.dat') ;
A(:,:,64)=load('F:\建模\题\第四问 2\第四问题的数据之二\t16-T1-1930832\c4.dat') ;
A(:,:,65)=load('F:\建模\题\第四问 2\第四问题的数据之二\t17-T2-1202999\c1.dat') ;
A(:,:,66)=load('F:\建模\题\第四问 2\第四问题的数据之二\t17-T2-1202999\c2.dat') ;
A(:,:,67)=load('F:\建模\题\第四问 2\第四问题的数据之二\t17-T2-1202999\c3.dat');
A(:,:,68)=load('F:\建模\题\第四问 2\第四问题的数据之二\t17-T2-1202999\c4.dat') ;
A(:,:,69)=load('F:\建模\题\第四问 2\第四问题的数据之二\t18-T2-1504519\c1.dat') ;
A(:,:,70)=load('F:\建模\题\第四问 2\第四问题的数据之二\t18-T2-1504519\c2.dat') ;
A(:,:,71)=load('F:\建模\题\第四问 2\第四问题的数据之二\t18-T2-1504519\c3.dat') ;
A(:,:,72)=load('F:\建模\题\第四问 2\第四问题的数据之二\t18-T2-1504519\c4.dat') ;
A(:,:,73)=load('F:\建模\题\第四问 2\第四问题的数据之二\t19-t2-1812492\c1.dat') ;
A(:,:,74)=load('F:\建模\题\第四问 2\第四问题的数据之二\t19-t2-1812492\c2.dat') ;
A(:,:,75)=load('F:\建模\题\第四问 2\第四问题的数据之二\t19-t2-1812492\c3.dat') ;
A(:,:,76)=load('F:\建模\题\第四问 2\第四问题的数据之二\t19-t2-1812492\c4.dat') ;
A(:,:,77)=load('F:\建模\题\第四问 2\第四问题的数据之二\t20-T2-1814688\c1.dat') ;
A(:,:,78)=load('F:\建模\题\第四问 2\第四问题的数据之二\t20-T2-1814688\c2.dat') ;
A(:,:,79)=load('F:\建模\题\第四问 2\第四问题的数据之二\t20-T2-1814688\c3.dat') ;
A(:,:,80)=load('F:\建模\题\第四问 2\第四问题的数据之二\t20-T2-1814688\c4.dat') ;
A(:,:,81)=load('F:\建模\题\第四问 2\第四问题的数据之二\t21-T2-1928033\c1.dat') ;
A(:,:,82)=load('F:\建模\题\第四问 2\第四问题的数据之二\t21-T2-1928033\c2.dat') ;
A(:,:,83)=load('F:\建模\题\第四问 2\第四问题的数据之二\t21-T2-1928033\c3.dat') ;
A(:,:,84)=load('F:\建模\题\第四问 2\第四问题的数据之二\t21-T2-1928033\c4.dat') ;
A(:,:,85)=load('F:\建模\题\第四问 2\第四问题的数据之二\t22-T2-1931817\c1.dat') ;
A(:,:,86)=load('F:\建模\题\第四问 2\第四问题的数据之二\t22-T2-1931817\c2.dat') ;
A(:,:,87)=load('F:\建模\题\第四问 2\第四问题的数据之二\t22-T2-1931817\c3.dat') ;
A(:,:,88)=load('F:\建模\题\第四问 2\第四问题的数据之二\t22-T2-1931817\c4.dat') ;
a1=564;
for i=1:22
    for j=1:22
        b1(i)=character(A(:,:,1+4*(i-1)),A(:,:,1+4*(i-1)+1),A(:,:,1+4*(i-1)+2),A(:,:,1+4*(i-1)+3),a1);
        b2(j)=character(A(:,:,1+(j-1)*4),A(:,:,1+1+(j-1)*4),A(:,:,1+2+(j-1)*4),A(:,:,1+3+(j-1)*4),a1);
        [h,r1,k]=charactermatch(b1,b2);
        R(i,j)=r1;
        K(i,j)=k;
    end
end
R
K
        






